/**
 * 部屋・スペース
 */
export const RoomKind = [
    "和室",
    "洋室",
    "リビング",
    "ダイニング",
    "キッチン",
    "LDK",
    "DK",
    "トイレ",
    "浴室",
    "洗面室",
    "サービスルーム",
    "物置",
    "納戸",
    "パントリー",
    "廊下",
    "階段",
    "内玄関",
    "その他",
];

/**
 * 建具・収納
 */
export const InteriorKind = [
    "ドア・扉",
    "収納建具",
    "網戸",
    "窓",
    "ふすま",
    "障子",
    "欄間",
    "クローゼット",
    "押し入れ",
    "床下収納",
    "階段下収納",
    "屋根裏収納",
    "シューズボックス",
    "ロフト・小屋裏収納",
    "その他",
];

/**
 * 外装
 */
export const ExteriorKind = [
    "堀・フェンス",
    "外壁",
    "屋根",
    "外玄関",
    "テラス・バルコニー・ベランダ",
    "庭",
    "雨戸・シャッター",
    "駐車場・カーポート",
    "その他",
];

/**
 * 家具・インテリア
 */
export const FurnitureKind = [
    "テーブル",
    "椅子",
    "ソファ",
    "机",
    "棚",
    "ボード",
    "その他",
];

/**
 * 家電
 */
export const HomeAppliancesKind = [
    "洗濯用家電",
    "掃除用家電",
    "季節家電",
    "調理用家電",
    "キッチン用家電",
    "美容・健康家電",
    "照明",
    "テレビ・オーディオ",
    "PC・サプライ",
    "事務用家電",
    "電話・FAX",
    "ドアホン",
    "その他",
];

/**
 * 家電
 */
export const FacilitiesKind = [
    "システムキッチン",
    "シンク",
    "コンロ",
    "レンジフード",
    "浴室",
    "洗面",
    "給湯器",
    "便器・温水洗浄器",
    "空調・換気",
    "発電・蓄電",
    "床暖房",
    "フローリング",
    "クロス",
    "その他",
];

/**
 * その他
 */
export const OtherKind = ["その他"];

export const UserGroup = {
    agentGrands: "agentGrands",
    agentNormal: "agentNormal",
    support: "support",
};
